app/Views/transaksi/riwayat_retur.php

SELECT *
FROM `transaksi_item`
WHERE `transaksi_item`.`id` = '25'
SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'
---
                        <?php
                            $transaksiItemModel = new \App\Models\Transaksi_Item_Model();
                            $produkModel = new \App\Models\Produk_Model();
                            $item = $transaksiItemModel->find($r['transaksi_item_id']);
                            $produk = $produkModel->find($item['produk_id']);