app/Controllers/Produk.php

    public function index()
    {
        $model = new Produk_Model();
        $data['produk'] = $model->findAll();
---
SELECT *
FROM `produk`

    public function edit($id = null)
    {
        $model = new Produk_Model();
        $data['produk'] = $model->where('id', $id)->first();
---
SELECT *
FROM `produk`
WHERE `id` = '3'
 LIMIT 1