app/Controllers/Transaksi.php

    public function index()
    {
        $produkModel = new Produk_Model();
        $data['produk'] = $produkModel->findAll();
---
SELECT *
FROM `produk`

    public function store()
{
    $db = \Config\Database::connect();
    $db->transStart();

    try {
        $transaksiModel = new \App\Models\Transaksi_Model();
        $transaksiItemModel = new \App\Models\Transaksi_Item_Model();
        $produkModel = new \App\Models\Produk_Model();

        $cart = $this->request->getPost('cart');
        $totalHarga = 0;

        if (!$cart) {
            return redirect()->to('/transaksi')->with('error', 'Keranjang belanja kosong.');
        }

        $transaksiItemsData = [];
        foreach ($cart as $produkId => $item) {
            if ($item['jumlah'] > 0) {
                $produk = $produkModel->find($produkId);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = 1

            'tanggal'     => date('Y-m-d H:i:s'),
            'total_harga' => $totalHarga,
        ];
        $transaksiModel->save($transaksiData);
---
INSERT INTO `transaksi` (`tanggal`, `total_harga`, `created_at`, `updated_at`) VALUES ('2025-08-30 05:41:58', 266000, '2025-08-30 05:41:58', '2025-08-30 05:41:58')

        // Simpan detail produk dan kurangi stok
        foreach ($transaksiItemsData as $item) {
            $item['transaksi_id'] = $transaksiId;
            $transaksiItemModel->save($item);

            $produk = $produkModel->find($item['produk_id']);
            $newStok = $produk['stok'] - $item['jumlah'];
            $produkModel->update($item['produk_id'], ['stok' => $newStok]);
---
INSERT INTO `transaksi_item` (`produk_id`, `jumlah`, `harga_satuan`, `transaksi_id`, `created_at`, `updated_at`) VALUES (1, '7', '10000.00', 11, '2025-08-30 05:41:58', '2025-08-30 05:41:58')
SELECT *
FROM `produk`
WHERE `produk`.`id` = 1
UPDATE `produk` SET `stok` = 110, `updated_at` = '2025-08-30 05:41:58'
WHERE `produk`.`id` IN (1)

    public function history()
    {
        $transaksiModel = new Transaksi_Model();
        $data['transaksi'] = $transaksiModel->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `transaksi`
ORDER BY `id` DESC

    public function riwayat_retur()
    {
        $pengembalianModel = new \App\Models\Pengembalian_Model();
        $data['retur'] = $pengembalianModel->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `pengembalian`
ORDER BY `id` DESC